tap "ferdium/ferdium"
tap "homebrew/cask-drivers"
tap "macos-fuse-t/cask"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Test various flash cards
brew "f3"
# GitHub command-line tool
brew "gh"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake"
# Alternative to the official immich-CLI command written in Go
brew "immich-go"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Extraction utility for .zip compressed archives
brew "unzip"
# Internet file retriever
brew "wget"
# Note editor and whiteboard
cask "affine"
# Application launcher and productivity software
cask "alfred"
# Agent orchestration platform
cask "antigravity"
# Terminal interface for Antigravity agents
cask "antigravity-cli"
# AI Coding Agent IDE
cask "antigravity-ide"
# Chromium based browser
cask "arc"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Anthropic's official Claude AI desktop app
cask "claude"
# Multi-platform multi-messaging app
cask "ferdium"
# Kext-less implementation of FUSE
cask "fuse-t"
# SSHFS implementation based on FUSE-T
cask "macos-fuse-t/cask/fuse-t-sshfs"
# Video format converter (transcoder)
cask "makemkv"
# Programmable solid 3D CAD modeller
cask "openscad"
# Web browser
cask "opera"
# G-code generator for 3D printers
cask "orcaslicer"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Connect to almost anything with a serial port
cask "serial"
# To-do & task list manager
cask "ticktick"
